#define _CRT_SECURE_NO_WARNINGS 
#include <stdio.h>
int main() {
//조건문------------------------------------- 

// if(조건문)
//{
//참일때 수행할 문장
//}
//예제)
//in num > num2){
//	printf("num1이 num2보다 더 크다");
//}
//----------------------------------------
	//방법 1--------------------------------------------
	//int a = 10;
	//	if(a>0) {
	//printf("양수");
	//}
	//else {
	//	if (a <0){
	//	printf("음수");
	//	}
	//else {
	//printf("양수도 음수도 아닙니다");
	//}
	//방법 2---표현을 간단하게 -----------------------------------------
		//int a = 10;
		//if (a > 0) 
		//	printf("양수");
		//else if (a < 0) 
		//	printf("음수");
		//else 
		//	printf("양수도 음수도 아닙니다");
		//	return 0;
		//---------------------------------------------------
	//실습)두 정수를 입력받아 큰수를 출력( 두수는 같을수도 있다)
	//int a = 10;
	//int b = 20;
	//if(a > b) 
	//	printf("%d",a);
	//else if 
	//	(b>a) printf("%d",b);
	//else 
	//	printf("a와 b의 값이 같습니다");
	
	//실습) 학생의 점수를 입력받아 학점을 출력하는 프로그램 작성
	//예) 점수 :85
	//int a ;
	//scanf("%d", &a);
	//if (a>=90) 
	//	printf("A학점입니다");
	//else if (a>=80) 
	//	printf("B학점입니다");
	//else if (a >= 70) 
	//	printf("C학점입니다");
	//else if (a >= 60) 
	//	printf("D학점입니다");
	//else 
	//	printf("F학점입니다");
	//--------------------------------------------------------------


	//int a= 101;
	////scanf("%d", &a);

	//if (a< 0 || a>=100) {
	//	pritnf("잘못된 점수");

	//	if (a >= 90)
	//		printf("A학점입니다");
	//	else if (a >= 80)
	//		printf("B학점입니다");
	//	else if (a >= 70)
	//		printf("C학점입니다");
	//	else if (a >= 60)
	//		printf("D학점입니다");
	//	else
	//		printf("F학점입니다");
	//}


	//실습 학생의 국,영,수 점수를 입력받아 총점과 평균을 출력 해보시오 
	//(단 60점 미만이 한과목이라도 있으면 과락)

	//int a, b, c,sum;
	//float average;
	//scanf("%d %d %d", &a, &b, &c);
	//sum = a + b + c;
	//average = sum / 3.;

	//if (a < 60 || b < 60 || c < 60) {
	//	printf("과락입니다\n");
	//	//return;
	//}
	//else
	//	printf("합은 %d ", sum);
	//	printf("평균값은%.2f", average);
	//-------------------------------------------------------

//실습) 년도를 입력받아 윤달여부를 출력하시오 ---------------------
	//년도는 2021년은 윤달이 아닙니다 
	// 1번에 해당하는 해중 년도/100 또 나누어 떨어지면 윤년 x

//int year = 2021;
//
//if (year % 4 == 0 && year % 100 != 0 || year%400==0) {
//	printf("윤년입니다");
//}
//else {
//	printf("윤년이 아닙니다");
//}
//실습) 보기메뉴를 보고 음식을 선택하면 가야할 코너를 알려주는프로그램----------------
// 1,자장면 2, 짬뽕, 3,설러탕 4,비빔밥,5,피자 ,6스파게티 메뉴를 선택
//1,2 중식 코너 ,3,4번 한식 5,6 양식
printf("보기선택 1.자장면 2.짬뽕 3.설러탕 4.비빔밥 5.피자 6스파게티\n");
printf("-----------------------------------------------------------");
int choise ;
	scanf("%d", &choise);
if (choise == 1 || choise == 2) {
	printf("중식코너");
}
else if (choise == 3 || choise == 4) {
	printf("한식코너");
}
else if (choise == 5 || choise == 6) {
	printf("양식코너");
}
else {
	printf("다시입력해주세요");
}
//----------------------------------------------






}


		



