#include <stdio.h>

int main() {
	//연산자 
	//int a = 20, b = 3;
	//정수와 정수 = 정수
	//실수와 정수 = 실수

	//printf("%d" "+", "%d=", "%d+%d", a, b, a + b);

	//printf("%d+%d=%d\n", a, b, a+b);
	//printf("%d-%d=%d\n", a, b, a-b);
	//printf("%d*%d=%d\n", a, b, a * b);
	//printf("%d-%d=%.2f\n", a, b, (double)a / b);

	//printf("%d %% %d = %d\n", a, b, a % b); //나머지는 %한개가 아니고 %%두개


	//실습 a=50,b=3일대 다음의 값을 구하시오
	//몫
	//나머지
	//나눈 실수값
	
	//int a = 50;
	//int b = 3;

	//printf("1.몫은: %d / %d = %d\n", a, b, a / b);
	//printf("2.나머지는: %d %% %d = %d\n", a, b, a % b);

	//printf("3.실수값: %f\n,",(double)a / b);

	//단항연산자
	// ++, --
	
	//int a = 10;
	//a++; 
	//a--;
	//printf("%d\n", a);

	//int a = 10;
	//printf("%d\n", a++);// 출력을 하고 증가해라
	//printf("%d\n", a);  
	//printf("%d\n", ++a);// 증가하고 출력

	//실습)1------------------------------
	//int a = 10;
	//a--;
	//printf("%d\n", a--); //9
	//printf("%d\n", a++); //8
	//printf("%d\n", a--); //9
	//printf("%d\n", a); //8
	
	//실습)2-----------------------------

	//int a = 10; //a = 10;
	//int b = --a; // b = 9 ;
	//int c = b++; //c= 9 ..........프린트 후 >>>10일될것
	//b = ++a; //b = 10 ;

	//printf("%d %d %d%", a, b, c);

	//a=10. b=10, c 9
	//----------------------------------------

	//관계연산자 
	// < , > , == , != , <= , 
	//	int a = 10; 
	//int b = 20;
	//printf("%d\n",a < b);	//  참이면 1,  java 에서는 true 
	//printf("%d\n", a > b);	// 거짓이면 0,  java에서는 false
	//printf("%d\n", a == b);	// 0 false
	//printf("%d\n", a != b); // 같지 않냐? true 

	//논리연산자 
	// &&, || ,!
	//int a = 10, b = 20;
	//printf("%d\n", a > 0 && b > 0);	//둘다 참이면 true
	//printf("%d\n", a > 0 && b < 0); // 둘중에 하나 라도 거짓이면 false
	//
	//printf("%d\n", a > 0 || b < 0); // 둘중에 하나라도 참이면 true

	//------------------------------------------------------------------
	//비트연산자 : & , | , ~ , ^
	//printf("%d\n", 4 & 3);
	//printf("%d\n", 4 | 3);
	
	//시프트 연산자 
/*	printf("%d\n", 4 >> 2); */ //4는 0100 으로 나온다 4>>를 2번(2비트)옆으로 밀기  그럼 맨뒤 2에숫자 00은 없어지고 
							 // 0010 으로 나옴  
							 // 즉) 0100 >> 0010 으로 됨 
	//--------------------------------------------------------------------

	// 삼항 연산자 (c언어에만 있다 )
	
	//int a = 10;
	//a > 0 ? printf("양수") :printf("음수");
			//맞으면 양수  : // 틀리면 음수 (else)
	//두수중 큰수를 출력

	//int a = 10, b = 20;

	//a > b ? printf("%d a큽니다", a) : printf("%d b가큽니다",b);
	
	//-------간단한 방법---------------------------------------------------------
	//int c = a > b ? a : b;

	//printf("%d\n", c);
	//-------------------------------------------------

	//실습3) 20 10 30 의 3개의 정수가 주어졌을대 가장 큰값을 구하는 프로그램
	//삼항 연산자를 이용하여 만들오 보시오 
	//가장큰값은 30입니다
	
	//int a = 10,	b = 20,	 c = 30;

	//int d = a > b ? a : b;
	//int f = d > c ?   d : c;

	//printf("%d이 가장 큽니다", f);

	//---강사님이한거----------------------------
	// 1번째 방법
	//int a = 10, b = 20, c = 30;

	//int max = a > b ? a : b;
	//max = max > c ? max : c;

	//printf("%d이 가장 큽니다", max);
	//---2번재-------------------------
	
	//int a = 10, b = 20, c = 30;

	//int max = a > b ? (a > c ? a : c) : (b > c ? b : c);
	////				 참일때				거짓일때 

	//printf("%d이 가장 큽니다", max);
//---------------------------------------------------------
// 
//실습-- 어떤 정수가주어 졌을때 짝.홀수 판별하여 출력하시오---
	
	//int i = 10;
	//
	//i%2==0 ? printf("짝수입니다") : printf("홀수입니다");

//----------------강사님이 한거------------------------------------
// 짝 홀수 판별*/ 

//int a = 6;
//	//포인터변수를 이용해서 출력
//char* p = a % 2 == 0 ? "짝수" : "홀수";
//printf("%d는 %s\n", a, p);






	


}
